{
  "name": "Justine Upano",
  "job_title": "Web Developer",
  "intros": [
    "I'm a web developer with over 2 years of experience creating meaningful digital experiences. Currently a frontend developer at New Stars Solutions, where I focus on building intuitive interfaces that solve real user problems.",
    "My design philosophy centers around understanding user needs, iterating quickly, and creating solutions that are both beautiful and functional. I believe great design happens at the intersection of user research, business goals, and technical possibilities.",
    "When I'm not coding, you can find me exploring new design trends, and experimenting with new creative tools and techniques."
  ],
  "experiences": [
    {
      "title": "ReactJS Developer",
      "subtitle": "New Stars Solutions Inc.",
      "date": "September 2023 - Present",
      "details": [
        "Pioneered the revamp of a back-office, affiliate, and member-facing web application of an international gaming firm.",
        "Involved in the development and maintenance of reusable components by utilizing AntD and Shopify Polaris.",
        "Incorporated RESTful APIs into the frontend of the application to enable communication with backend services.",
        "Reviewed, and supported code from a team member to ensure it follows correct team guidelines and practices in implementing solutions.",
        "Actively participated with multinational teams in daily meetings, identifying issues early and providing constructive suggestions to enhance team efficiency and project outcomes."
      ],
      "technologies": ["reactjs", "nextjs", "typescript", "scss", "restapi"],
      "current": true
    },
    {
      "title": "Intern Web Developer",
      "subtitle": "Sabang Elementary School",
      "date": "March 2023 - June 2023",
      "details": [
        "Collaborated with the team as a Fullstack developer to build a web-based student management system tailored for teachers and admins, enabling efficient tracking of student information and grades.",
        "Implemented CRUD operations in PHP and connected to a MySQL database for data persistence, ensuring proper data structure and performance.",
        "Gained a comprehensive understanding of coding patterns and best practices while crafting PHP programs, enhancing overall coding proficiency.",
        "Participated in discussions and decision-making processes to define the system’s features and functionalities, improving user experience and system design.",
        "Worked closely with the faculty, teachers, and staff to gather system requirements, helping define features, user roles, and functionality based on real educational workflows."
      ],
      "technologies": ["html", "css", "javascript", "php", "mysql"],
      "current": false
    }
  ],
  "skills": [
    {
      "title": "Development",
      "items": [
        "html",
        "css",
        "javascript",
        "typescript",
        "reactjs",
        "nextjs",
        "nodejs",
        "php",
        "python",
        "postresql",
        "mysql",
        "restapi"
      ]
    },
    {
      "title": "Design",
      "items": ["figma", "canva", "excalidraw"]
    },
    {
      "title": "Research",
      "items": ["design patterns", "good practices", "ui/ux research", "prototyping"]
    }
  ],
  "interests": ["📚 Articles", "🏃‍♂️ Running", "🎮 Gaming", "🎵 Music", "✈️ Travel", "📷 Photography"]
}
